// JAVASCRIPT
// JS - ЭТО ОДНОПОТОЧНЫЙ ЯЗЫК, ОН ВЫПОЛНЯЕТ КОД В ОДНОМ ПОТОКЕ

// JS - ЭТО ДИНАМИЧЕСКИ ТИПИЗИРОВАННЫЙ ЯЗЫК, ПЕРЕМЕННЫЕ НЕ ПРИВЯЗАНЫ К ОПРЕДЕЛЕННОМУ ТИПУ ДАННЫХ

// JS - ЭТО ИНТЕРПРЕТИРОВАННЫЙ ЯЗЫК, ВЫПОЛНЯЕТСЯ В БРАУЗЕРЕ БЕЗ ПРЕДВАРИТЕЛЬНОЙ КОМПИЛЯЦИИ


// ЗАМЫКАНИЕ - ЭТО ФУНКЦИЯ КОТОРАЯ ПОМНИТ СВОЁ ЛЕКСИЧЕСКОЕ ОКРУЖЕНИЕ, ДАЖЕ КОГДА ОНА ВЫПОЛНЯЕТСЯ ВНЕ СВОЕЙ ПЕРВОНАЧАЛЬНОЙ ОБЛАСТИ ВИДИМОСТИ


// HOISTING - ФУНКЦИЯ ОБЪЯВЛЕНИЯ ЧЕРЕЗ FUNCTION, ПОЛНОСТЬЮ ПОДНИМАЮТСЯ И МОГУТ БЫТЬ ВЫЗВАНЫ ДО ОБЪЯВЛЕНИЯ


// || - ЭТОТ ОПЕРАТОР ПРОВЕРЯЕТ ОБА ОПЕРАНДА
// ЕСЛИ ХОТЯ-БЫ ОДНО ВЫРАЖЕНИЕ ИСТИННО, РЕЗУЛЬТАТ БУДЕТ TRUE


// THROW NEW ERROR('SOME ERROR') - СОЗДАЁТ НОВУЮ ОШИБКУ


// TRY/CATCH - ЭТО МЕХАНИЗМ ОБРАБОТКИ ОШИБОК, ОН ПОЗВОЛЯЕТ ПЕРЕХВАТЫВАТЬ ОШИБКИ В КОДЕ И ПРЕДОТВРАЩАТЬ ПАДЕНИЕ ПРОГРАММЫ


// МОДУЛИ : 
// EXPORT / IMPORT

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -